Autodesk.Revit.DB.BarTypeDiameterOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BarTypeDiameterOptions.StirrupTieBendDiameter
Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions.StandardHookBendDiameter
Represents the standard hook bend diameter of the RebarBarType.
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions.StandardBendDiameter
Represents the standard bar bend diameter of the RebarBarType.
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions.BarDiameter
Represents the bar diameter of the RebarBarType.
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions.#ctor(Autodesk.Revit.DB.Structure.RebarBarType)
Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions.#ctor
Constructs a new BarTypeDiameterOptions with default settings.
Since:
2018.1

Autodesk.Revit.DB.BarTypeDiameterOptions
This class stores the diameter information from the RebarBarType.
Remarks:
This class can be used to create a whole new set of diameter values for a RebarBarType.
It can be used when copying the diameter information as a bulk of data from a RebarBarType to another.
The new diameters can be set in the RebarBarType in the following way:
1. Create a BarTypeDiameterOptions object with the new diameters.
2. Set the new diameters in RebarBarType using Autodesk::Revit::DB::Structure::RebarBarType::SetBarTypeDiameters(Autodesk::Revit::DB::BarTypeDiameterOptions ^diametersOpt).
The method Autodesk::Revit::DB::Structure::RebarBarType::SetBarTypeDiameters(Autodesk::Revit::DB::BarTypeDiameterOptions ^diametersOpt)
is responsible for diameters validation.
Since:
2018.1